import React, {useState, useEffect} from 'react';
import {
  View,
  Text,
  ScrollView,
  SafeAreaView,
  TouchableOpacity,
} from 'react-native';
import {getPolicy} from '../../actions/data.actions';
import {Header} from 'react-native-elements';
import HTML from 'react-native-render-html';
import {connect} from 'react-redux';
import I18n from '../../utils/I18n';
import Icon from 'react-native-vector-icons/AntDesign';
import Style from '../../page/Setting/Styles';
const Registerpolicy = ({dispatch, navigation}) => {
  const [Policy_th, setPolicy] = useState();
  const [Policy_en, setPolicy_en] = useState();

  const _getPolicy = async values => {
    try {
      // const response = await dispatch(getPolicy());
      // if (response.res_code === '00') {
      //   setPolicy(response.res_result.policy_th);
      //   setPolicy_en(response.res_result.policy_en);
      // } else {
      // }
      //   console.log(response);
    } catch (error) {}
  };

  useEffect(() => {
    try {
      _getPolicy();
    } catch (error) {}
  }, []);

  return (
    <View style={{flex: 1}}>
      <Header
        centerComponent={
          <View style={{alignSelf: 'center'}}>
            <Text
              style={{
                fontSize: 25,
                color: '#000000',
                fontFamily: 'Kittithada Bold 75',
              }}>
              {I18n.t('translate_RegisterPolicy')}
            </Text>
          </View>
        }
        leftComponent={
          <TouchableOpacity
            style={{padding: 0}}
            onPress={() => navigation.goBack()}>
            <Icon name="left" size={20} />
          </TouchableOpacity>
        }
        backgroundColor="transparent"
      />
      <ScrollView>
        <View style={{width: '85%', alignSelf: 'center', marginBottom: 30}}>
          <HTML
            containerStyle={Style.color}
            baseFontStyle={Style.fontSize}
            html={
              '1 กฎระเบียบทั่วไป \n1.1 ใบสมัครเข้าร่วมงานจะเปลี่ยนเป็นสัญญาการเข้าร่วมงาน เมื่อผู้สมัครได้รับคัดเลือกให้เข้าร่วมงานโดยได้รับการจัดสรรคูหาจากผู้จัดงาน และได้ชำระค่าเข้าร่วมงานครบเต็มจำนวนแล้ว' +
              ' \n1.2 การไม่ปฏิบัติตามสัญญาจะเป็นผลต่อผู้เข้าร่วมงานในการเข้าร่วมงานครั้งนี้หรือในอนาคต ทั้งนี้ผู้เข้าร่วมงานจะต้องรับผิดชอบค่าเข้าร่วมงานในสัญญาที่เกี่ยวข้อง และชดเชยค่าเสียหายตามจำนวนที่เกิดขึ้นจริง' +
              '\n1.3 ผู้เข้าร่วมงานต้องปฎิบัติตามเงื่อนไขและกฏระเบียบที่ได้แจ้งไว้ หรือด้วยวิธีใดก็ตาม รวมทั้งกฎระเบียบเพิ่มเติมที่แจ้งโดยผู้จัดงาน เช่น ในคู่มือผู้เข้าร่วมงาน (Exhibitor Manual)' +
              '\n' +
              '\n2 การสมัครเข้าร่วมงานและคุณสมบัติของผู้เข้าร่วมงาน' +
              '\n2.1 การสมัครเข้าร่วมงานและการคัดเลือกผู้เข้าร่วมงานจะเกิดขึ้น เมื่อผู้จัดงานได้รับการชำระเงินค่าเข้าร่วมงานและใบสมัครที่สมบูรณ์พร้อมเอกสารหลักฐานต่างๆ ที่ผู้จัดงานต้องการ ทั้งนี้ผู้จัดงานจะแจ้งผลการเข้าร่วมงานให้ท่านทราบเป็นลายลักษณ์อักษร' +
              '\n2.2 หากผู้เข้าร่วมงานเป็นนิติบุคคลจะต้องจดทะเบียนถูกต้องตามกฎหมาย และไม่มีประวัติเสียหายในการประกอบธุรกิจ' +
              '\n' +
              '\n3 สิทธิการเข้าร่วมงานและจัดสรรพื้นที่' +
              '\n3.1 ผู้เข้าร่วมงานไม่สามารถโอนสิทธิในการเข้าร่วมงานและพื้นที่ทั้งหมด หรือบางส่วนที่ได้รับการจัดสรรให้ผู้อื่นได้ตลอดระยะเวลาการจัดงาน' +
              '\n3.2 ผู้จัดงานไม่อนุญาตให้มีนิติบุคคลหรือบุคคลอื่นใดที่ไม่ได้สมัครเข้าร่วมงาน มาจัดแสดงในพื้นที่เดียวกับของผู้เข้าร่วมงานเป็นอันขาด'+
              '\n3.3 ผู้จัดงานไม่อนุญาตให้มีนิติบุคคลหรือบุคคลอื่นใดที่ไม่ได้สมัครเข้าร่วมงาน มาจัดแสดงในพื้นที่เดียวกับของผู้เข้าร่วมงานเป็นอันขาด' +
              'ผู้จัดงานขอสงวนสิทธิในการจัดสรรคูหา โดยจะตัดสินจากประเภท/คุณภาพสินค้า วันที่สมัครเข้าร่วมงานและการชำระเงิน จำนวนคูหาความร่วมมือในกิจกรรมของกรมฯที่ผ่านมา' +
              ' อีกทั้งขอสงวนสิทธิในการเปลี่ยนแปลงวันที่ สถานที่จัดงาน ที่ตั้ง ขนาดคูหา หรืออื่นๆตามความเหมาะสม ทั้งนี้ผู้เข้าร่วมงานไม่สามารถเรียกค่าทดแทนจากผู้จัดงานได้' +
              '\n3.4 กรณีที่ผู้ได้รับคัดเลือกแล้วไม่สามารถเข้าร่วมงานได้ ผู้สมัครยินยอมสละเงินที่ได้รับชำระแล้วสมทบเป็นค่าใช้จ่ายโครงการ และผู้จัดงานอาจตัดสิทธิการเข้าร่วมงานในครั้งต่อไป'+
              '\n' +
              '\n4 กฎระเบียบการจำหน่ายสินค้า' +
              '\n4.1 ผู้เข้าร่วมงานสามารถจำหน่ายสินค้าได้ภายในคูหาของตนเองเท่านั้น'+
              '\n4.2 สินค้าที่จัดแสดงหรือจำหน่ายในงานต้องเป็นสินค้าที่ปรากฏในเอกสารการสมัครเท่านั้น ผู้จัดงานมีสิทธิ์ที่จะนำสินค้าจัดแสดงที่ไม่เกี่ยวข้องกับงานแสดงสินค้าออกจากอาคารแสดงสินค้าได้ทันที '+
              'สำหรับการดำเนินการและการสาธิตการขายจะต้องกระทำในขอบเขตมาตรฐานที่เป็นที่ยอมรับ'+
              '\n4.3 ห้ามไม่ให้ผู้เข้าร่วมงานนำสินค้าที่ละเมิดลิขสิทธิ์/สินค้านำเข้าจากต่างประเทศมาจำหน่ายภายในงาน'+
              '\n'+
              '\n5 เงื่อนไขการชำระเงิน'+
              '\n5.1 ผู้เข้าร่วมงานต้องชำระเงินเต็มจำนวนของค่าเข้าร่วมงานในวันที่กำหนด ผู้จัดงานมีสิทธิที่จะถอดสิทธิ์การเข้าร่วมงาน'+
              '\n5.2 ไม่มีการคืนเงินที่ชำระมาแล้วไม่ว่ากรณีใดๆก็ตาม'+
              '\n5.3 ผู้เข้าร่วมงานไม่สามารถครอบครองพื้นที่จัดแสดงได้ จนกว่าจะชำระเงินค่าเข้าร่วมงานครบจำนวน'+
              '\n5.4 ในกรณีที่เกิดเหตุสุดวิสัยที่ไม่สามารถควบคุมได้ เช่น สงคราม การปฏิวัติรัฐประหาร การนัดหยุดงาน ไฟไหม้ หรือเหตุการณ์ที่เทียบเท่า ซึ่งทำให้ต้องเลื่อนหรือยกเลิกการจัดงานแสดงสินค้า จะไม่มีการคืนเงินค่าเข้าร่วมงานที่ผู้เข้าร่วมงานจ่ายไปแล้ว'+
              '\n'+
              '6 การก่อสร้าง/ตกแต่งคูหา/การขนย้ายสิ่งของ'+
              '\n6.1 ผู้เข้าร่วมงานสามารถเลือกที่จะใช้คูหามาตรฐานที่ก่อสร้างโดยผู้รับเหมาก่อสร้างที่ได้รับเลือกเป็นทางการจากผู้จัดงาน หรือออกแบบก่อสร้างตกแต่งคูหาเองได้ ทั้งนี้ต้องมีการปูพื้นและสร้างผนังคูหาให้เรียบร้อย'+
              '\n6.2 ผู้เข้าร่วมงานไม่สามารถต่อเติม หรือก่อสร้างตกแต่งให้สูงกว่าความสูงของคูหามาตรฐาน เว้นแต่ได้รับความยินยอมจากผู้จัดงาน'+
              '\n6.3 กรณีก่อสร้างคูหาเอง จะต้องส่งแบบคูหาให้ผู้จัดงานพิจารณาอนุมัติเพื่อความปลอดภัย หากคณะผู้จัดงานพบว่าการก่อสร้างไม่เป็นไปตามแบบที่อนุมัติ คณะผู้จัดงานมีสิทธิพิจารณาไม่อนุญาตให้บริษัทฯ เข้าดำเนินการ และตัดสิทธิในการเข้าร่วมงานในปีต่อๆไป'+
              '\n'+
              '7 การแก้ไขกฎระเบียบต่างๆ'+
              '\nผู้จัดงานอาจแก้ไขกฎระเบียบใดๆ เมื่อมีเหตุสุดวิสัยทีหลีกเลี่ยงไม่ได้ ทั้งนี้ผู้เข้าร่วมงานยินยอมที่จะรับและปฏิบัติตามกฎระเบียบใหม่นี้'+
              '\n'+
              '8 การให้การยกเว้น'+
              '\nผู้จัดงานจะไม่มีการยกเว้น ยกเลิกเงื่อนไข กฎระเบียบ หรือสิทธิ์ต่างๆ ยกเว้นในกรณีที่มีการเขียนเป็นลายลักษณ์อักษรโดยผู้อำนวยการระดับบริหารการจัดงาน'+
              '\n'+
              '9 บทลงโทษ'+
              '\nคณะผู้จัดงานจะเพิกถอนสิทธิ หรือไม่พิจาณาให้สิทธิในการเข้าร่วมงานแสดงสินค้าที่เห็นสมควรในกรณี ดังนี้'+
              '\n9.1 ชำระเงินค่าเข้าร่วมงานไม่ครบจำนวนตามที่กำหนด หรือไม่ยอมจ่ายเงินค่าใช้จ่ายอื่นๆ อันพึ่งต้องชำระภายในระยะเวลาที่กำหนด'+
              '\n9.2 สินค้าที่จัดแสดงและจำหน่ายในงานจะต้องเป็นสินค้าที่ปรากฎในเอกสารการสมัครเท่านั้น และไม่อนุญาตให้นำสินค้าที่ไม่ใช่ของตนเองหรือลอกเลียนแบบสินค้าของผู้ผลิตรายอื่นๆ (กรณีได้รับการร้องเรียน) หรือการปฏิบัติผิดประเพณีทางการค้ามาแสดงและจำหน่ายในงาน'+
              '\n9.3 กรณีได้รับการคัดเลือกแล้ว และทราบภายหลังว่าหลักฐานที่ใช้สมัครไม่ถูกต้อง คณะผู้จัดงานจะพิจารณายกเลิกการเข้าร่วมงานการบอกเลิกการเข้าร่วมงานเมื่อใกล้เวลาเริ่มงานแสดงสินค้าอย่างกะทันหัน '+
              'โดยไม่มีเหตุผล หรือไม่จัดส่งผู้แทนบริษัทประจำคูหาตามที่กำหนดเวลาแสดงสินค้า'+
              '\n9.4 ปฏิบัติตนไม่เหมาะสมต่อเจ้าหน้าที่โครงการหรือผู้เข้าร่วมงานอื่นๆหรือปฏิบัติตนให้เป็นที่เสื่อมเสียต่อภาพลักษณ์ที่ดีของประเทศ'+
              '\n9.5 ไม่ปฏิบัติตามเงื่อนไขการเข้าร่วมงานฯ และฝ่าฝืนกฎระเบียบการเข้าร่วมงานฯ ตามที่ระบุในหนังสือคู่มือผู้เข้าร่วมงาน'+
              '\n9.6 กรณีก่อสร้างคูหาเองจะต้องส่งแบบคูหาให้ผู้จัดงานพิจารณาอนุมัติเพื่อความปลอดภัย หากคณะผู้จัดงานพบว่ามีการฝ่าฝืนคณะผู้จัดงานจะดำเนินการตักเตือน หรือตัดกระแสไฟฟ้าในคูหาระหว่างการจัดงาน และปิดคูหา'+
              '\n9.7 ไม่อนุญาตให้รื้อถอนคูหาระหว่างการจัดงาน โดยจะสามารถดำเนินการรื้อถอนคูหาได้หลังจากจบงานในวันสุดท้าย'+
              '\n'+
              '10 การรับผิด'+
             '\n10.1 ผู้เข้าร่วมงานไม่มีสิทธิฟ้องร้อง/เรียกร้องสิทธิจากผู้จัดงานในเรื่องความเสียหาย การสูญหาย การตัดสินใจ ค่าใช้จ่าย ต้นทุนหรือค่าธรรมเนียมที่เกิดขึ้นจากความผิดพลาด ละเลย ที่ผู้เข้าร่วมงาน หรือผู้รับเหมา หรือผู้รับเหมาช่วงเป็นผู้กระทำ'+
             '\n10.2 ผู้จัดงานจะไม่รับผิดชอบชดใช้ค่าเสียหายไม่ว่ากรณีใดๆ ต่อความเสียหายหรือสูญหายที่เกิดขึ้นกับบุคคล ทรัพย์สิน หรือสิทธิประโยชน์ของผู้เข้าร่วมงาน อันเกิดจากเหตุสุดวิสัย ภัยธรรมชาติ กาเกิดการรจลาจล การโจรกรรม อัคคีภัยต่างๆ ซึ่งไม่อยู่ในวิสัยที่จะป้องกันได้'+
             '\n10.3 ผู้จัดงานจะไม่รับผิดชอบชดใช้ค่าเสียหาย ไม่ว่ากรณีใดๆ อันเกิดจากการก่อสร้างเอง/ตกแต่งคูหา/การขนย้ายสิ่งของ ซึ่งทำให้เกิดความเสียหายกับบุคคล ทรัพย์สิน หรือสิทธิประโยชน์ของผู้เข้าร่วมงาน'


              
            }
          />
        </View>
      </ScrollView>
    </View>
  );
};

const mapDispatchToProps = dispatch => ({
  dispatch,
});

const mapStateToProps = state => ({
  getUser: state.userReducer.getUser,
});

export default connect(
  mapStateToProps,
  mapDispatchToProps,
)(Registerpolicy);
