const Datadevelop = [
  {
    name: 'สูตรสำเร็จ...ค้าออนไลน์ขายทั่วไทยไปทั่วโลก',
    location: 'สถาบันพัฒนาผู้ประกอบการการค้า',
    Detail:
      'พบกับวิทยากรมากประสบการณ์ทั้งการค้าในประเทศ และต่างประเทศที่จะมาแชร์ประสบการณ์และการรับมือ',
    Date: '    19 \nมิ.ย. 2563',
  },
  {
    name: 'ครบเครื่องเรื่องการค้าออนไลน์ by NEA',
    location: 'ออนไลน์',
    Detail:
      'สถาบัน NEA กำหนดจัดโครงการสัมมนาภายใต้ชื่อ หลักสูตร "ครบเครื่องเรื่องการค้าออนไลน์ By NEA" โดยเป็นการ',
    Date: ' 17 - 18\nมิ.ย. 2563',
  },
  {
    name: 'อบรมเชิงปฏิบัติการ โครงการ Train the Trainers',
    location: 'โรงแรมสุนีย์แกรนด์ โฮเทล แอน',
    Detail:
      'หากคุณมีคุณสมบัติเหล่านี้ทางสถาบันพัฒนาผู้ประกอบการการค้ายุคใหม่ ดำเนินงานภายใต้กรมส่งเสริมการค้าระหว่าง',
    Date: ' 12 - 14\nก.พ. 2563',
  },
  {
    name: 'โครงการ สินค้าดอยออนไลน์ขายสู่ตลาดโลก',
    location: 'หญ่าโย ฟาร์ม (วาวี คอฟฟี่)',
    Detail:
      'สร้างองค์ความรู้ เพิ่มศักยภาพ เพิ่มช่องทางในการทำการตลาดด้านการค้าออนไลน์ยุคใหม่และการค้าระหว่างประเทศให้กับผู้ประกอบการ',
    Date: '    6\nก.พ. 2563',
  },
];
export default Datadevelop;
