const DataDeve = [
  {
    name: 'อบรมเชิงปฏิบัติการ โครงการ Train the Trainers',
    people: 100,
    country: 'ประเทศไทย, กรุงเทพมหานครฯ',
    Countyimg: require('../image/thai.png'),
    Date: '19 ก.ย. 2563',
    Toppick: 0,
    Live: 0,
  },
  {
    name: 'โครงการ สินค้าดอยออนไลน์ขายสู่ตลาดโลก',
    people: 100,
    country: 'ประเทศไทย, กรุงเทพมหานครฯ',
    Date: '15 - 19 ก.ย. 2563',
    Toppick: 0,
    Live: 0,
    Countyimg: require('../image/thai.png'),
  },
  {
    name: 'สูตรสำเร็จ...ค้าออนไลน์ขายทั่วไทยไปทั่วโลก',
    location: 'สถาบันพัฒนาผู้ประกอบการการค้า',
    people: 100,
    detail:
      'พบกับวิทยากรมากประสบการณ์ทั้งการค้าในประเทศ และต่างประเทศ\nที่จะมาแชร์ประสบการณ์และการรับมือ',
    country: 'ประเทศไทย, กรุงเทพมหานครฯ',
    Date: '   19 \nมิ.ย. 2563',
    Toppick: 1,
    Live: 0,
  },
  {
    name: 'ครบเครื่องเรื่องการค้าออนไลน์ by NEA',
    location: 'ออนไลน์',
    people: 100,
    detail:
      'สถาบัน NEA กำหนดจัดโครงการสัมมนาภายใต้ชื่อ หลักสูตร\n "ครบเครื่องเรื่องการค้าออนไลน์ By NEA" โดยเป็นการ',
    country: 'ประเทศไทย, กรุงเทพมหานครฯ',
    Date: ' 17 - 18 \nมิ.ย. 2563',
    Toppick: 1,
    Live: 0,
  },
  {
    name: 'อบรมเชิงปฏิบัติการ โครงการ Train the Trainers',
    location: 'โรงแรมสุนีย์แกรนด์ โฮเทล แอน',
    people: 100,
    detail:
      'หากคุณมีคุณสมบัติเหล่านี้ทางสถาบันพัฒนาผู้ประกอบการ\nการค้ายุคใหม่ ดำเนินงานภายใต้กรมส่งเสริมการค้าระหว่าง',
    country: 'ประเทศไทย, กรุงเทพมหานครฯ',
    Date: ' 12 - 14 \nก.พ. 2563',
    Toppick: 1,
    Live: 0,
  },
  {
    name: 'โครงการ สินค้าดอยออนไลน์ขายสู่ตลาดโลก',
    location: 'หญ่าโย ฟาร์ม (วาวี คอฟฟี่)',
    people: 100,
    detail:
      'สร้างองค์ความรู้ เพิ่มศักยภาพ เพิ่มช่องทางในการทำการ\nตลาดด้านการค้าออนไลน์ยุคใหม่และการค้าระหว่างประเทศให้กับ\nผู้ประกอบการ',
    country: 'ประเทศไทย, กรุงเทพมหานครฯ',
    Date: '    6 \nก.พ. 2563',
    Toppick: 1,
    Live: 0,
  },
];
export default DataDeve;
