const DataScan = [
  {
    name: 'อบรมเชิงปฏิบัติการ โครงการ Train the Trainers',
    date: '5 - 8',
    month: 'มี.ค. 2563',
    deteView: '5 มีนาคม 2563 - 8 มีนาคม 2563',
    location: 'โรงแรมสุนีย์แกรนด์ โฮเทล แอน',
    img: require('../image/imgdev.png'),
    people: 53,
    imgview: require('../image/Activity.png'),
    Detail:
      'ถ้าคุณมีประสบการณ์ด้านการค้าระหว่างประเทศพร้อมที่จะถ่ายทอดความรู้ให้กับผู้อื่นหากคุณมีคุณสมบัติเหล่านี้ทางสถาบันพัฒนาผู้ประกอบการการค้ายุคใหม่ ดำเนินงานภายใต้กรมส่งเสริมการค้าระหว่างประเทศ ขอเชิญชวนเข้าร่วมโครงการสร้างพี่เลี้ยงทางการค้า (Train the Trainer by NEA) ปี 2563 เพื่อเปิดโอกาสให้ผู้ที่มีศักยภาพได้เรียนรู้การเป็นผู้ให้คำปรึกษา ด้านการค้าระหว่างประเทศ ได้แสดงศักยภาพในการถ่ายทอดองค์ความรู้ให้กับผู้ประกอบการและต่อยอดความรู้ไปสู่เวทีระดับสากลได้อย่างแท้จริง',
    count: 75,
  },

  {
    name: 'โครงการ สินค้าดอยออนไลน์ขายสู่ตลาดโลก',
    date: '5 - 8',
    month: 'มี.ค. 2563',
    location: 'หญ่าโย ฟาร์ม (วาวี คอฟฟี่)',
    img: require('../image/imgdev.png'),
    deteView: '5 มีนาคม 2563 - 8 มีนาคม 2563',
    people: 53,
    imgview: require('../image/Activity.png'),
    Detail:
      'ถ้าคุณมีประสบการณ์ด้านการค้าระหว่างประเทศพร้อมที่จะถ่ายทอดความรู้ให้กับผู้อื่นหากคุณมีคุณสมบัติเหล่านี้ทางสถาบันพัฒนาผู้ประกอบการการค้ายุคใหม่ ดำเนินงานภายใต้กรมส่งเสริมการค้าระหว่างประเทศ ขอเชิญชวนเข้าร่วมโครงการสร้างพี่เลี้ยงทางการค้า (Train the Trainer by NEA) ปี 2563 เพื่อเปิดโอกาสให้ผู้ที่มีศักยภาพได้เรียนรู้การเป็นผู้ให้คำปรึกษา ด้านการค้าระหว่างประเทศ ได้แสดงศักยภาพในการถ่ายทอดองค์ความรู้ให้กับผู้ประกอบการและต่อยอดความรู้ไปสู่เวทีระดับสากลได้อย่างแท้จริง',
    count: 75,
  },
];

export default DataScan;
